app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT "clientes".* FROM "clientes"

  def create
    @cliente = Cliente.new(cliente_params)
    @cliente.save
---
INSERT INTO "clientes" ("created_at", "fono", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-24 22:49:57.257410"], ["fono", "9655488"], ["nombre", "Luciano Cisternas"], ["updated_at", "2015-11-24 22:49:57.257410"]]

    def set_cliente
      @cliente = Cliente.find(params[:id])
---
SELECT  "clientes".* FROM "clientes"  WHERE "clientes"."id" = ? LIMIT 1  [["id", 1]]