app/controllers/frecuentes_controller.rb

  def index
    @frecuentes = Frecuente.all
---
SELECT "frecuentes".* FROM "frecuentes"

  def create
    @frecuente = Frecuente.new(frecuente_params)
    @frecuente.save
---
INSERT INTO "frecuentes" ("cliente_id", "created_at", "email", "updated_at") VALUES (?, ?, ?, ?)  [["cliente_id", 1], ["created_at", "2015-11-24 22:56:58.812255"], ["email", "luciano.cisternas@gmail.com"], ["updated_at", "2015-11-24 22:56:58.812255"]]

    def set_frecuente
      @frecuente = Frecuente.find(params[:id])
---
SELECT  "frecuentes".* FROM "frecuentes"  WHERE "frecuentes"."id" = ? LIMIT 1  [["id", 1]]