app/controllers/productos_controller.rb

  def index
    @productos = Producto.all
---
SELECT "productos".* FROM "productos"

  def create
    @producto = Producto.new(producto_params)
    @producto.save
---
INSERT INTO "productos" ("created_at", "detalle", "nombre", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-24 22:50:29.018946"], ["detalle", "20 piezas"], ["nombre", "Promo 1"], ["updated_at", "2015-11-24 22:50:29.018946"]]

    def set_producto
      @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos"  WHERE "productos"."id" = ? LIMIT 1  [["id", 1]]